// packagebuy/pages/spellgoods/spellgoods.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    stateData:[ 
      {
        tite: '什么是全民邀新团?',
        content: '任意用户可开团成为团长，但只有新用户才能参团。'
      },
      {
        tite: '什么是VIP邀新团？',
        content: '普通用户不可开团，只有VIP用户才能开团，新用户只能参团。'
      },
      {
        tite: '什么是新用户？',
        content: '在悦店没有进行过订单支付的用户。如果第一次参与拼团，但拼团为失败状态，仍旧会视为新用户。'
      },
      {
        tite: '拼团流程是什么？',
        content: '支付开团 ·邀请新用户参团·  成功等待发货· 失败退款'
      },
      {
        tite: '拼团商品可以退款吗？',
        content: '拼团商品同普通商品一样，如果发现商品质量问题，可以与客服联系进行退款操作。'
      },
      {
        tite: '拼团失败金额如何返还？',
        content: '拼团失败，金额将原路退回您的微信账户。'
      },
      {
        tite: '拼团商品何时发货？',
        content: '拼团成功的情况下，次日发货（产地直发商品视具体情况而定）。'
      },
      {
        tite: '支付成功后，如何查找我的订单?',
        content: '当您支付成功后，可以在“我的拼团”中查找订单；但是，只有拼团成功后，您才可以在”我的订单““待发货”中看到您的订单。'
      },
      {
        tite: '如果我是VIP，拼团成功后，好友会成为自己的团队成员吗?',
        content: '如果您邀请的好友不属于任何团队，在拼团成功后，如果他（她）同意您的邀请，那么该好友将成为您的团队成员。'
      },

    ]   
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})